In [7]:
import pandas as pd

In [8]:
Sat_college = pd.read_csv("./SAT__College_Board__2010_School_Level_Results_20240506.csv")

In [9]:
Sat_college

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
0,01M292,Henry Street School for International Studies,31.0,391.0,425.0,385.0
1,01M448,University Neighborhood High School,60.0,394.0,419.0,387.0
2,01M450,East Side Community High School,69.0,418.0,431.0,402.0
3,01M458,SATELLITE ACADEMY FORSYTH ST,26.0,385.0,370.0,378.0
4,01M509,CMSP HIGH SCHOOL,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
455,75R025,South Richmond High School,10.0,407.0,421.0,400.0
456,75X012,PS12X LEWIS AND CLARK SCHOOL,NaN,NaN,NaN,NaN
457,75X754,P754 X - Jeffrey M. Rapport School for Career ...,NaN,NaN,NaN,NaN
458,76K460,John Jay High School,9.0,390.0,381.0,398.0
459,79X490,PHOENIX SCHOOL,7.0,404.0,423.0,416.0

In [10]:
Sat_college[Sat_college['Writing Mean']==Sat_college['Writing Mean'].max()].count

<bound method DataFrame.count of        DBN              School Name  Number of Test Takers  \
42  02M475  STUYVESANT HIGH SCHOOL                   804.0

    Critical Reading Mean  Mathematics Mean  Writing Mean
42                  674.0             735.0         678.0  >

In [15]:
grouped=Sat_college.groupby('DBN')['Writing Mean'].value_counts()

In [16]:
grouped

DBN     Writing Mean
01M292  385.0           1
01M448  387.0           1
01M450  402.0           1
01M458  378.0           1
01M515  314.0           1
                       ..
32K554  395.0           1
32K556  351.0           1
75R025  400.0           1
76K460  398.0           1
79X490  416.0           1
Name: count, Length: 386, dtype: int64

In [17]:
grouped.dtypes

dtype('int64')

In [18]:
grouped= Sat_college.groupby('DBN')['School Name'].sum()

In [19]:
grouped

DBN
01M292       Henry Street School for International Studies
01M448                 University Neighborhood High School
01M450                     East Side Community High School
01M458                        SATELLITE ACADEMY FORSYTH ST
01M509                                    CMSP HIGH SCHOOL
                                ...
75R025                          South Richmond High School
75X012                        PS12X LEWIS AND CLARK SCHOOL
75X754    P754 X - Jeffrey M. Rapport School for Career ...
76K460                                John Jay High School
79X490                                      PHOENIX SCHOOL
Name: School Name, Length: 458, dtype: object

In [2]:
import pandas as pd

In [3]:
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Value': [10, 15, 20, 25, 30, 35]}
df = pd.DataFrame(data)

In [4]:
df

  Category  Value
0        A     10
1        B     15
2        A     20
3        B     25
4        A     30
5        B     35

In [5]:
grouped = df.groupby('Category')['Value'].sum()

In [6]:
grouped

Category
A    60
B    75
Name: Value, dtype: int64

In [20]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 22, 28]}
df = pd.DataFrame(data)

In [26]:
sorted_df = df.sort_values(by='Age')

In [27]:
sorted_df

      Name  Age
2  Charlie   22
0    Alice   25
3    David   28
1      Bob   30

In [23]:
sorted_df = df.sort_values(by='Age', ascending=False)

In [24]:
sorted_df

      Name  Age
1      Bob   30
3    David   28
0    Alice   25
2  Charlie   22

In [32]:
sorted_df=Sat_college.sort_values(by='DBN', ascending=False)

In [33]:
sorted_df

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
459,79X490,PHOENIX SCHOOL,7.0,404.0,423.0,416.0
458,76K460,John Jay High School,9.0,390.0,381.0,398.0
457,75X754,P754 X - Jeffrey M. Rapport School for Career ...,NaN,NaN,NaN,NaN
456,75X012,PS12X LEWIS AND CLARK SCHOOL,NaN,NaN,NaN,NaN
455,75R025,South Richmond High School,10.0,407.0,421.0,400.0
...,...,...,...,...,...,...
4,01M509,CMSP HIGH SCHOOL,NaN,NaN,NaN,NaN
3,01M458,SATELLITE ACADEMY FORSYTH ST,26.0,385.0,370.0,378.0
2,01M450,East Side Community High School,69.0,418.0,431.0,402.0
1,01M448,University Neighborhood High School,60.0,394.0,419.0,387.0
0,01M292,Henry Street School for International Studies,31.0,391.0,425.0,385.0